Revit 2024 API
TemporaryGraphicsManager.GetTemporaryGraphicsManager Method
 Gets a TemporaryGraphicsManager reference of the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static TemporaryGraphicsManager GetTemporaryGraphicsManager(
	Document document
)
Visual Basic
Public Shared Function GetTemporaryGraphicsManager ( _
	document As Document _
) As TemporaryGraphicsManager
Visual C++
public:
static TemporaryGraphicsManager^ GetTemporaryGraphicsManager(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 Instance of TemporaryGraphicsManager.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace